detail_data/k6関係/5000_10_2.txt

     data_received..................: 10 GB  290 MB/s
     data_sent......................: 430 kB 12 kB/s
     http_req_blocked...............: avg=44.52µs min=0s      med=0s      max=12.28ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=14.74µs min=0s      med=0s      max=9.35ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=68.71ms min=44.91ms med=65ms    max=151.64ms p(90)=88.38ms p(95)=97.09ms
       { expected_response:true }...: avg=68.71ms min=44.91ms med=65ms    max=151.64ms p(90)=88.38ms p(95)=97.09ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=26.11ms min=5.9ms   med=23.13ms max=99.85ms  p(90)=41.33ms p(95)=48.79ms
     http_req_sending...............: avg=208.3µs min=0s      med=0s      max=33.13ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.39ms min=21.42ms med=39.85ms max=126.99ms p(90)=51.95ms p(95)=59.05ms
     http_reqs......................: 5000   143.292657/s
     iteration_duration.............: avg=69.18ms min=44.9ms  med=65.42ms max=153.63ms p(90)=88.9ms  p(95)=98.13ms
     iterations.....................: 5000   143.292657/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  291 MB/s
     data_sent......................: 430 kB 12 kB/s
     http_req_blocked...............: avg=37.12µs  min=0s      med=0s      max=14.87ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=8.73µs   min=0s      med=0s      max=3.28ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=68.18ms  min=44.95ms med=65.02ms max=177.38ms p(90)=86.62ms p(95)=95.31ms
       { expected_response:true }...: avg=68.18ms  min=44.95ms med=65.02ms max=177.38ms p(90)=86.62ms p(95)=95.31ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=26.26ms  min=3.99ms  med=23.42ms max=113.21ms p(90)=40.95ms p(95)=47.04ms
     http_req_sending...............: avg=171.11µs min=0s      med=0s      max=28.86ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.74ms  min=3.99ms  med=39.83ms max=138.74ms p(90)=49.9ms  p(95)=55.24ms
     http_reqs......................: 5000   143.970141/s
     iteration_duration.............: avg=68.54ms  min=45.08ms med=65.34ms max=177.67ms p(90)=87.12ms p(95)=95.81ms
     iterations.....................: 5000   143.970141/s
     vus............................: 8      min=8         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  298 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=42.08µs  min=0s      med=0s      max=28.97ms  p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=8.81µs   min=0s      med=0s      max=8.4ms    p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=66.13ms  min=43.28ms med=62.72ms max=197.99ms p(90)=84.96ms p(95)=93.83ms 
       { expected_response:true }...: avg=66.13ms  min=43.28ms med=62.72ms max=197.99ms p(90)=84.96ms p(95)=93.83ms 
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.47ms  min=2.01ms  med=21.36ms max=133.62ms p(90)=39.53ms p(95)=46.35ms 
     http_req_sending...............: avg=182.25µs min=0s      med=0s      max=31.01ms  p(90)=0s      p(95)=970.19µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=41.47ms  min=32.87ms med=39.33ms max=154.65ms p(90)=49.95ms p(95)=55.44ms 
     http_reqs......................: 5000   147.484638/s
     iteration_duration.............: avg=66.49ms  min=43.28ms med=63.03ms max=198.04ms p(90)=85.55ms p(95)=94.55ms 
     iterations.....................: 5000   147.484638/s
     vus............................: 8      min=8         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  295 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=41.7µs   min=0s      med=0s      max=14.85ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=5.19µs   min=0s      med=0s      max=2.55ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.67ms  min=44.07ms med=63.12ms max=179.52ms p(90)=85.69ms p(95)=96.21ms
       { expected_response:true }...: avg=66.67ms  min=44.07ms med=63.12ms max=179.52ms p(90)=85.69ms p(95)=96.21ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.71ms  min=8.12ms  med=21.36ms max=132.11ms p(90)=40.61ms p(95)=47.74ms
     http_req_sending...............: avg=192.54µs min=0s      med=0s      max=42.03ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.76ms  min=32.89ms med=39.72ms max=107.88ms p(90)=49.86ms p(95)=55.65ms
     http_reqs......................: 5000   145.895602/s
     iteration_duration.............: avg=67.07ms  min=44.07ms med=63.41ms max=179.51ms p(90)=86.29ms p(95)=96.97ms
     iterations.....................: 5000   145.895602/s
     vus............................: 2      min=2         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  299 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=32.04µs  min=0s      med=0s      max=9.95ms   p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=8.16µs   min=0s      med=0s      max=3ms      p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.07ms  min=44.6ms  med=62.39ms max=179.15ms p(90)=85.19ms p(95)=94.4ms 
       { expected_response:true }...: avg=66.07ms  min=44.6ms  med=62.39ms max=179.15ms p(90)=85.19ms p(95)=94.4ms 
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.33ms  min=8.99ms  med=21.15ms max=120.05ms p(90)=40ms    p(95)=46.72ms
     http_req_sending...............: avg=214.99µs min=0s      med=0s      max=48.92ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.52ms  min=32.58ms med=39.26ms max=129.26ms p(90)=50.1ms  p(95)=56.26ms
     http_reqs......................: 5000   147.993782/s
     iteration_duration.............: avg=66.48ms  min=44.91ms med=62.76ms max=179.14ms p(90)=85.65ms p(95)=95.57ms
     iterations.....................: 5000   147.993782/s
     vus............................: 8      min=8         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  291 MB/s
     data_sent......................: 430 kB 12 kB/s
     http_req_blocked...............: avg=53.55µs min=0s      med=0s      max=15.57ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=17.17µs min=0s      med=0s      max=15.02ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=68.32ms min=43.92ms med=65.2ms  max=150ms    p(90)=87.07ms p(95)=95.55ms
       { expected_response:true }...: avg=68.32ms min=43.92ms med=65.2ms  max=150ms    p(90)=87.07ms p(95)=95.55ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=26.26ms min=2.63ms  med=23.54ms max=102.28ms p(90)=42.19ms p(95)=48.78ms
     http_req_sending...............: avg=243.4µs min=0s      med=0s      max=23.46ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.81ms min=32.3ms  med=39.65ms max=119.29ms p(90)=49.84ms p(95)=56.5ms 
     http_reqs......................: 5000   144.18077/s
     iteration_duration.............: avg=68.78ms min=43.92ms med=65.65ms max=151.87ms p(90)=87.73ms p(95)=96.39ms
     iterations.....................: 5000   144.18077/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  295 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=32.39µs  min=0s      med=0s      max=8.91ms   p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=5.57µs   min=0s      med=0s      max=3.99ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.2ms   min=14.5ms  med=63.39ms max=188.12ms p(90)=86.36ms p(95)=95.69ms
       { expected_response:true }...: avg=67.2ms   min=14.5ms  med=63.39ms max=188.12ms p(90)=86.36ms p(95)=95.69ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.79ms  min=0s      med=21.91ms max=127.81ms p(90)=39.66ms p(95)=46.03ms
     http_req_sending...............: avg=232.01µs min=0s      med=0s      max=63.38ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.18ms  min=13.74ms med=39.4ms  max=134.68ms p(90)=52.38ms p(95)=60.53ms
     http_reqs......................: 5000   145.956801/s
     iteration_duration.............: avg=67.63ms  min=14.5ms  med=63.84ms max=188.11ms p(90)=87ms    p(95)=96.07ms
     iterations.....................: 5000   145.956801/s
     vus............................: 4      min=4         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  292 MB/s
     data_sent......................: 430 kB 12 kB/s
     http_req_blocked...............: avg=40.09µs  min=0s      med=0s      max=13.53ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=11.72µs  min=0s      med=0s      max=9.36ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.87ms  min=43.22ms med=64.01ms max=189.33ms p(90)=88.64ms p(95)=98.24ms
       { expected_response:true }...: avg=67.87ms  min=43.22ms med=64.01ms max=189.33ms p(90)=88.64ms p(95)=98.24ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.48ms  min=6.23ms  med=21.85ms max=133.7ms  p(90)=42.59ms p(95)=49.98ms
     http_req_sending...............: avg=186.79µs min=0s      med=0s      max=17.99ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.2ms   min=23.24ms med=40.11ms max=98.15ms  p(90)=50.44ms p(95)=57.08ms
     http_reqs......................: 5000   144.448865/s
     iteration_duration.............: avg=68.33ms  min=43.22ms med=64.4ms  max=189.32ms p(90)=89.55ms p(95)=99.06ms
     iterations.....................: 5000   144.448865/s
     vus............................: 8      min=8         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  300 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=48.49µs  min=0s      med=0s      max=23.14ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=11.55µs  min=0s      med=0s      max=8.34ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.37ms  min=44.28ms med=62.75ms max=213.13ms p(90)=85.38ms p(95)=94.28ms
       { expected_response:true }...: avg=66.37ms  min=44.28ms med=62.75ms max=213.13ms p(90)=85.38ms p(95)=94.28ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.93ms  min=7.93ms  med=21.6ms  max=123.68ms p(90)=40.61ms p(95)=47.52ms
     http_req_sending...............: avg=231.22µs min=0s      med=0s      max=23.85ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.2ms   min=32.48ms med=39.18ms max=120.56ms p(90)=48.89ms p(95)=55.17ms
     http_reqs......................: 5000   148.234014/s
     iteration_duration.............: avg=66.82ms  min=44.28ms med=63.21ms max=213.13ms p(90)=86.31ms p(95)=95.02ms
     iterations.....................: 5000   148.234014/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  293 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=50.42µs  min=0s      med=0s      max=19.28ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=18.16µs  min=0s      med=0s      max=19.28ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.73ms  min=44.92ms med=64.38ms max=172.61ms p(90)=88.15ms p(95)=96.46ms
       { expected_response:true }...: avg=67.73ms  min=44.92ms med=64.38ms max=172.61ms p(90)=88.15ms p(95)=96.46ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.88ms  min=3.04ms  med=22.59ms max=121.6ms  p(90)=42.65ms p(95)=49ms   
     http_req_sending...............: avg=201.77µs min=0s      med=0s      max=25.83ms  p(90)=0s      p(95)=998.2µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.64ms  min=33.07ms med=39.58ms max=113.3ms  p(90)=49.74ms p(95)=55.81ms
     http_reqs......................: 5000   144.838031/s
     iteration_duration.............: avg=68.16ms  min=45.57ms med=64.71ms max=172.6ms  p(90)=88.74ms p(95)=97.47ms
     iterations.....................: 5000   144.838031/s
     vus............................: 6      min=6         max=10
     vus_max........................: 10     min=10        max=10